; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	infrared1 - mode
	image0 - mode
	Star6 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star1 - direction
	GroundStation4 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 image0)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument6 infrared1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(pointing satellite2 GroundStation4)
	(pointing satellite3 GroundStation2)
	(have_image Star7 image0)
	(have_image Phenomenon8 image0)
	(have_image Phenomenon9 infrared1)
	(have_image Phenomenon10 infrared1)
	(have_image Planet11 infrared1)
	(have_image Star12 infrared1)
	(have_image Phenomenon13 image0)
	(have_image Phenomenon14 infrared1)
	(have_image Planet15 image0)
	(have_image Phenomenon16 image0)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 13
2. (calibrate satellite2 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 0 of 13
3. (turn_to satellite2 phenomenon16 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon16)
   goals met: 0 of 13
4. (take_image satellite2 phenomenon16 instrument4 image0)
   added: (have_image phenomenon16 image0)
   goals met: 1 of 13
5. (turn_to satellite2 phenomenon14 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 13
6. (take_image satellite2 phenomenon14 instrument4 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 2 of 13
7. (turn_to satellite2 phenomenon13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 13
8. (take_image satellite2 phenomenon13 instrument4 image0)
   added: (have_image phenomenon13 image0)
   goals met: 3 of 13
9. (turn_to satellite2 phenomenon10 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 13
10. (turn_to satellite1 groundstation2 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation2)
   goals met: 4 of 13
11. (take_image satellite2 phenomenon10 instrument4 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 5 of 13
12. (turn_to satellite2 phenomenon8 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon8)
   goals met: 5 of 13
13. (take_image satellite2 phenomenon8 instrument4 image0)
   added: (have_image phenomenon8 image0)
   goals met: 6 of 13
14. (turn_to satellite2 phenomenon9 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon9)
   goals met: 6 of 13
15. (take_image satellite2 phenomenon9 instrument4 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 7 of 13
16. (turn_to satellite2 planet11 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet11)
   goals met: 7 of 13
17. (take_image satellite2 planet11 instrument4 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 8 of 13
18. (turn_to satellite2 planet15 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet15)
   goals met: 8 of 13
19. (take_image satellite2 planet15 instrument4 image0)
   added: (have_image planet15 image0)
   goals met: 9 of 13
20. (turn_to satellite2 star12 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 star12)
   goals met: 9 of 13
21. (take_image satellite2 star12 instrument4 infrared1)
   added: (have_image star12 infrared1)
   goals met: 10 of 13
22. (turn_to satellite2 star7 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star7)
   goals met: 10 of 13
23. (take_image satellite2 star7 instrument4 image0)
   added: (have_image star7 image0)
   goals met: 11 of 13
24. (turn_to satellite2 groundstation4 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation4)
   goals met: 12 of 13
25. (turn_to satellite3 groundstation2 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 groundstation2)
   goals met: 13 of 13
